Amiya200/stm32_water_tank/Core/Src/model_handle.c
    return stableLevel;
}

static bool isTankFull(void)
{
    return (get_tank_level_percent() == 100);
}
typedef enum {
    RESTART_RUN_TEST = 0,
    RESTART_WAIT_GAP,
    RESTART_RUN_CONTINUOUS
} RestartState;


static RestartState restartState = RESTART_RUN_TEST;
static uint32_t restartDeadline = 0;

void ModelHandle_StartRestart(void)
{
    if (isTankFull())
        return;

    backup_current_mode();

    restartActive = true;
    restartState  = RESTART_RUN_TEST;
    restartDeadline = 0;

    motorOwner = MOTOR_OWNER_RESTART;
    senseMaxRunReached = false;

    start_motor();
}


void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive) return;
    ModelHandle_ProcessTimerSlots();
}
void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}
uint16_t ModelHandle_GetGapTime(void)        { return sys.gap_time_s; }
uint8_t  ModelHandle_GetRetryCount(void)     { return sys.retry_count; }
uint16_t ModelHandle_GetUnderVolt(void)      { return sys.uv_limit; }
uint16_t ModelHandle_GetOverVolt(void)       { return sys.ov_limit; }
float    ModelHandle_GetOverloadLimit(void)  { return sys.overload; }
float    ModelHandle_GetUnderloadLimit(void) { return sys.underload; }
uint16_t ModelHandle_GetMaxRunTime(void)     { return sys.maxrun_min; }
uint8_t ModelHandle_GetPowerRestoreMode(void)
{
    return powerRestoreMode;
}
void ModelHandle_SetPowerRestoreMode(uint8_t mode)
{
    if (mode > 2) mode = 0;
    powerRestoreMode = mode;
    ModelHandle_SaveModeState();
}
void ModelHandle_ToggleManual(void)
{
    /* Cancel restart if running */
    if (restartActive)
    {
        restartActive = false;
        motorOwner = MOTOR_OWNER_NONE;
    }

    if (!manualActive)
    {
        clear_all_modes();
        manualActive = true;
        motorOwner = MOTOR_OWNER_MANUAL;
    }
    else
    {
        manualActive = false;
        motorOwner = MOTOR_OWNER_NONE;
        stop_motor();
    }

    ModelHandle_SaveModeState();
}

void ModelHandle_ManualToggleMotor(void)
{
    if (!manualActive)
        return;

    if (Motor_GetStatus())
        stop_motor();
    else
        start_motor();
}


void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s  = 0;
    sys.retry_count = 0;
    sys.uv_limit    = 190;
    sys.ov_limit    = 270;
    sys.overload    = 0.0f;
    sys.underload   = 0.0f;
    sys.maxrun_min  = 300;
    ModelHandle_SaveSettingsToEEPROM();
}
void ModelHandle_StartTimerNearestSlot(void)
{
    ModelHandle_ProcessTimerSlots();
}

static inline void Buzzer_SetPin(bool on)
{
//    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
//                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
static void Buzzer_TriggerAlert(void)
{
    buzzerAlertUntil = HAL_GetTick() + 30000UL;  // 30 sec
}

static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();
    static bool buzzerState = false;
    bool newState = false;

    bool motorOn = Motor_GetStatus();

    /* ================= PUMP ON SOUND ================= */
    if (buzzerSettings.pumpOnSound && motorOn)
    {
        newState = true;  // continuous ON
    }

    /* ================= TANK FULL ================= */
    if (buzzerSettings.tankFullSound &&
        isTankFull() &&
        (now < buzzerAlertUntil))
    {
        newState = true;  // continuous long beep
    }

    /* ================= TANK EMPTY ================= */
    if (buzzerSettings.tankEmptySound &&
        get_tank_level_percent() == 0 &&
        (now < buzzerAlertUntil))
    {
        newState = ((now % 400UL) < 100UL);  // short beep pattern
    }

    if (newState != buzzerState)
    {
        buzzerState = newState;
        Buzzer_SetPin(buzzerState);
    }
}

static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}


static uint32_t motorOnStartMs = 0;
static uint32_t powerOnMs     = 0;

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
    bootStartBlockUntil = powerOnMs + MOTOR_START_DELAY_MS;

    autoDeadline = 0;

    if (timer_any_active_slot())
    {
        timerActive = true;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;
        motorOwner  = MOTOR_OWNER_TIMER;
    }

    /* Restore AUTO if active */
    if (autoActive)
    {
        motorOwner = MOTOR_OWNER_AUTO;
        autoState  = AUTO_ON_WAIT;

        uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
        autoDeadline = HAL_GetTick() + (gapSec * 1000UL);

        /* 🔥 Ignore groundwater for first 3 seconds after boot */
        autoBootIgnoreUntil = HAL_GetTick() + 3000UL;
    }
}

static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}
static bool Motor_StartAllowed(void)
{
    return true;   // TEMP: allow immediate start
}

bool ModelHandle_IsRestartActive(void)
{
    return restartActive;
}

static inline void motor_apply(bool on)
{
    if (timerActive && timerState == TIMER_STATE_OFF)
        on = false;

    bool relayNow = Motor_IsRelayOn();

    if (on)
    {
        if (!Motor_StartAllowed())
            return;

        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }
        motorStatus = 1;
    }
    else
    {
        if (relayNow)
            Relay_Set(1, false);
        motorStatus = 0;
    }

    UART_SendStatusPacket();
}

bool Motor_GetStatus(void)
{
    return Motor_IsRelayOn();
}
static inline void start_motor(void)
{
    uint32_t now = HAL_GetTick();

    if (now < bootStartBlockUntil &&
        motorOwner != MOTOR_OWNER_MANUAL &&
        motorOwner != MOTOR_OWNER_SEMIAUTO &&
        motorOwner != MOTOR_OWNER_TIMER &&
        motorOwner != MOTOR_OWNER_COUNTDOWN &&
        motorOwner != MOTOR_OWNER_TWIST)
    {
        return;
    }

