Amiya200/stm32_water_tank/Core/Src/model_handle.c
        timerActive = true;
        autoActive  = false;

        motorOwner  = MOTOR_OWNER_TIMER;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;

        start_motor();
    }

    /* ------------------ SLOT END ------------------ */
    if (timerActive && !slotActive)
    {
        stop_motor();

        timerActive = false;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;

        restore_previous_mode();
        ModelHandle_SaveModeState();
        return;
    }

    if (!timerActive)
        return;

    /* ------------------ SAFETY CHECKS ------------------ */
    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        stop_motor();
        return;
    }

    /* ------------------ GAP CALCULATION ------------------ */
    uint16_t slotGap = get_active_timer_gap_minutes();
    uint16_t mainGap = sys.gap_time_s / 60;

    uint16_t appliedGapMin = (slotGap > 0) ? slotGap : mainGap;
    uint32_t gapMs = appliedGapMin * 60UL * 1000UL;

    /* ------------------ CONTINUOUS MODE ------------------ */
    if (gapMs == 0)
    {
        motorOwner = MOTOR_OWNER_TIMER;
        start_motor();
        return;
    }

    /* ------------------ TIMER STATE MACHINE ------------------ */
    switch (timerState)
    {
        case TIMER_STATE_ON:
        {
            motorOwner = MOTOR_OWNER_TIMER;
            start_motor();

            if (timerStateDeadline == 0)
            {
                timerStateDeadline = now + gapMs;
            }

            if (now >= timerStateDeadline)
            {
                /* 🔥 Dry Run Condition Handling */
                if (!senseDryRun)
                {
                    // Normal behavior → go OFF
                    stop_motor();
                    timerState = TIMER_STATE_OFF;
                    timerStateDeadline = now + gapMs;
                }
                else
                {
                    // Dry Run active → Stay ON continuously
                    timerStateDeadline = now + gapMs;
                }
            }
        }
        break;

        case TIMER_STATE_OFF:
        {
            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_ON;
                timerStateDeadline = 0;
            }
        }
        break;

        default:
        {
            timerState = TIMER_STATE_ON;
            timerStateDeadline = 0;
        }
        break;
    }
}

void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;   // ADD THIS
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
typedef enum {
    SEMI_RUN_TEST = 0,
    SEMI_WAIT_GAP,
    SEMI_RUN_CONTINUOUS
} SemiState;

static SemiState semiState = SEMI_RUN_TEST;
static uint32_t  semiDeadline = 0;

static uint32_t semiWaterLossStart = 0;
static bool     semiWaterLossPending = false;

void ModelHandle_StartSemiAuto(void)
{
    restartActive = false;

    clear_all_modes();

    semiAutoActive = true;
    motorOwner     = MOTOR_OWNER_SEMIAUTO;

    semiState      = SEMI_RUN_TEST;
    semiDeadline   = 0;
    semiWaterLossPending = false;

    senseMaxRunReached = false;

    start_motor();

    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint8_t retry)
{
    if (autoActive)
        return;

    clear_all_modes();

    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;

    autoActive = true;
    autoState  = AUTO_ON_WAIT;

    uint32_t now = HAL_GetTick();
    uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;

    autoRunStartMs = now;
    autoDeadline   = now + (gapSec * 1000UL);

    motorOwner = MOTOR_OWNER_AUTO;   // 🔥 DIRECT ASSIGN
}

void ModelHandle_StopAuto(void)
{
    stop_motor();

    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    autoDeadline = 0;

    ModelHandle_SaveModeState();
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));

    /* HARD VALIDATION */

    if (auto_gap_s < 30 || auto_gap_s > 3600)
    {
        auto_gap_s = 120;   // force 2 min
        EEPROM_WriteBlockSafe(0x0300,
                              (uint8_t*)&auto_gap_s,
                              sizeof(auto_gap_s));
    }

    if (auto_maxrun_min == 0xFFFF || auto_maxrun_min > 600)
    {
        auto_maxrun_min = 30;
        EEPROM_WriteBlockSafe(0x0302,
                              (uint8_t*)&auto_maxrun_min,
                              sizeof(auto_maxrun_min));
    }

    if (auto_retry_limit == 0xFF || auto_retry_limit > 20)
    {
        auto_retry_limit = 3;
        EEPROM_WriteBlockSafe(0x0304,
                              (uint8_t*)&auto_retry_limit,
                              sizeof(auto_retry_limit));
    }
}


static void auto_mode_background_control(void)
{
    if (!autoBackgroundEnabled)
        return;
    if (timerActive)
        return;
    uint32_t now = HAL_GetTick();
    if (now < bootBlockUntil)
        return;
    if (manualActive || semiAutoActive ||
        countdownActive || twistActive ||
        autoActive)
        return;
    uint8_t level = get_tank_level_percent();
    if (!autoActive &&
        level <= AUTO_START_LEVEL_PERCENT)
    {
    	ModelHandle_StartAuto(
    	    sys.gap_time_s,
    	    auto_maxrun_min,
    	    auto_retry_limit
    	);

