Amiya200/stm32_water_tank/Core/Src/model_handle.c
    }
    if (autoActive &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
    }
}
static uint32_t autoTestStartTime = 0;
static bool     autoTestRunning   = false;

static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = HAL_GetTick();

    uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
    uint32_t gapMs  = gapSec * 1000UL;

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    /* ===== HARD STOP CONDITIONS ===== */
    if (isTankFull())
    {
        ModelHandle_StopAuto();
        Buzzer_TriggerAlert();
        return;
    }

    if (protectionFault)
    {
        ModelHandle_StopAuto();
        Buzzer_TriggerAlert();
        return;
    }

    switch (autoState)
    {
    /* ===================== ON PHASE ===================== */
    case AUTO_ON_WAIT:
    {
        /* Start motor if not running */
        if (!Motor_GetStatus())
        {
            motorOwner = MOTOR_OWNER_AUTO;
            start_motor();
            autoTestStartTime = now;
            autoTestRunning   = true;
            return;
        }

        /* Wait stabilization time before checking water */
        if (autoTestRunning && ((now - autoTestStartTime) < gapMs))
            return;

        autoTestRunning = false;

        /* 🔥 WATER CHECK AFTER STABILIZATION */
        if (!groundWater || !senseDryRun)
        {
            stop_motor();

            auto_retry_count++;

            if (auto_retry_count >= auto_retry_limit)
            {
                ModelHandle_StopAuto();
                Buzzer_TriggerAlert();
                return;
            }

            autoDeadline = now + gapMs;
            autoState    = AUTO_OFF_WAIT;
            return;
        }

        /* If water available → keep running until tank full */
        /* No need to stop here */
    }
    break;

    /* ===================== OFF WAIT ===================== */
    case AUTO_OFF_WAIT:
    {
        stop_motor();

        if (now >= autoDeadline)
        {
            autoState = AUTO_ON_WAIT;
        }
    }
    break;

    default:
        autoState = AUTO_ON_WAIT;
    break;
    }
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds == 0)
        return;
    clear_all_modes();
    senseMaxRunReached = false;
    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;
    motorOwner = MOTOR_OWNER_COUNTDOWN;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}

static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();
    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }

    uint32_t remainingMs = cd_deadline - now;
    countdownDuration = remainingMs / 1000UL;
}

static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}

static void SaveCountdown(void)
{
    CountdownBlock b;
    memset(&b, 0, sizeof(b));
    b.sig = CD_SIGNATURE;
    b.active = countdownActive;
    if (countdownActive)
    {
        uint32_t now = now_ms();
        if (cd_deadline > now)
            b.remaining = (cd_deadline - now) / 1000UL;
        else
            b.remaining = 0;
    }
    else
    {
        b.remaining = 0;
    }
    b.crc = CD_CRC((uint8_t*)&b, sizeof(b)-2);
    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                       (uint8_t*)&b,
                       sizeof(b));
}

void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                      (uint8_t*)&b, sizeof(b));
    if (b.sig != CD_SIGNATURE)
        return;
    if (CD_CRC((uint8_t*)&b, sizeof(b)-2) != b.crc)
        return;
    if (b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline = now_ms() +
                      b.remaining * 1000UL;
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

static void twist_tick(void)
{
	if (!twistActive) return;
	    if (isTankFull())
	    {
	        ModelHandle_StopTwist();
	        Buzzer_TriggerAlert();
	        return;
	    }
    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor();
    else stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (dryState == DRY_WAITING)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 400);
        LED_ApplyIntents();
        return;
    }
    if (dryState == DRY_FAULT)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
        LED_ApplyIntents();
        return;
    }
    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);
    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}
uint32_t ap = 0 ;
#define RESTART_WATER_LOSS_CONFIRM_MS  5000UL   // 5 sec delay
static uint32_t restartWaterLossStart = 0;
static bool     restartWaterLossPending = false;
#define COUNTDOWN_GAP_MS   15000UL   // 15 seconds fixed gap

