Amiya200/stm32_water_tank/Core/Src/model_handle.c
typedef enum {
    CD_RUN_TEST = 0,
    CD_WAIT_GAP,
    CD_RUN_CONTINUOUS
} CountdownState;

static CountdownState cdState = CD_RUN_TEST;
static uint32_t cdTestStartTime = 0;
static uint32_t cdGapDeadline = 0;
static uint32_t cdWaterLossStart = 0;
static bool     cdWaterLossPending = false;

void ModelHandle_Process(void)
{
    uint32_t now = HAL_GetTick();
    if (modeSwitchPending)
    {
        if (now >= modeSwitchTime)
        {
            modeSwitchPending = false;
            motorOwner = pendingOwner;
        }
        return;
    }
    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();
    ModelHandle_CheckLoadFault();
    check_max_run();
    ModelHandle_SoftDryRunHandler();
    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;
    ModelHandle_ProcessTimerSlots();
    if (restartActive)
        motorOwner = MOTOR_OWNER_RESTART;
    else if (timerActive)
        motorOwner = MOTOR_OWNER_TIMER;
    else if (manualActive)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (semiAutoActive)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (countdownActive)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (twistActive)
        motorOwner = MOTOR_OWNER_TWIST;
    else if (autoActive)
        motorOwner = MOTOR_OWNER_AUTO;
    else
        motorOwner = MOTOR_OWNER_NONE;
    if (Motor_GetStatus() && isTankFull())
    {
        if (!tankFullPendingStop)
        {
            tankFullPendingStop = true;
            tankFullDetectedAt = now;
        }
        if ((now - tankFullDetectedAt) >= TANK_FULL_DELAY_MS)
        {
            stop_motor();
            tankFullPendingStop = false;
        }
    }
    else
    {
        tankFullPendingStop = false;
    }
    switch (motorOwner)
    {
    case MOTOR_OWNER_RESTART:
    {
        uint32_t now = HAL_GetTick();

        bool overloadEnabled  = (sys.overload    > 0.0f);
        bool underloadEnabled = (sys.underload   > 0.0f);
        bool voltEnabled      = (sys.uv_limit    > 0 || sys.ov_limit > 0);
        bool maxrunEnabled    = (sys.maxrun_min  > 0);
        uint32_t gapMs = (uint32_t)sys.gap_time_s * 1000UL;
        if (gapMs == 0)
            gapMs = 10000UL;
        if (isTankFull())
        {
            ModelHandle_StopRestart();
            Buzzer_TriggerAlert();
            break;
        }
        if ((overloadEnabled  && senseOverLoad) ||
            (underloadEnabled && senseUnderLoad) ||
            (voltEnabled      && senseOverUnderVolt) ||
            (maxrunEnabled    && senseMaxRunReached))
        {
            stop_motor();
            restartState    = RESTART_WAIT_GAP;
            restartDeadline = now + gapMs;
            break;
        }
        switch (restartState)
        {
            case RESTART_RUN_TEST:
            {
                start_motor();
                if (senseDryRun == true)
                {
                    restartState    = RESTART_RUN_CONTINUOUS;
                    restartDeadline = 0;
                    break;
                }
                if (restartDeadline == 0)
                {
                    restartDeadline = now + gapMs;
                }
                if (now >= restartDeadline)
                {
                    stop_motor();
                    restartState    = RESTART_WAIT_GAP;
                    restartDeadline = now + gapMs;
                }
            }
            break;
            case RESTART_WAIT_GAP:
            {
                stop_motor();

                if (now >= restartDeadline)
                {
                    restartState    = RESTART_RUN_TEST;
                    restartDeadline = 0;
                }
            }
            break;

            case RESTART_RUN_CONTINUOUS:
            {
                start_motor();
                if (senseDryRun == false)
                {
                    if (!restartWaterLossPending)
                    {
                        restartWaterLossPending = true;
                        restartWaterLossStart   = now;
                    }
                    if ((now - restartWaterLossStart) >= RESTART_WATER_LOSS_CONFIRM_MS)
                    {
                        stop_motor();
                        restartState    = RESTART_WAIT_GAP;
                        restartDeadline = now + gapMs;

                        restartWaterLossPending = false;
                    }
                }
                else
                {
                    restartWaterLossPending = false;
                }
            }
            break;
            default:
            {
                restartState    = RESTART_RUN_TEST;
                restartDeadline = 0;
            }
            break;
        }
    }
    break;

        case MOTOR_OWNER_MANUAL:
        {
            if (!protectionFault)
                start_motor();
            else
                stop_motor();
        }
        break;
        case MOTOR_OWNER_SEMIAUTO:
        {
            uint32_t now = HAL_GetTick();

            bool overloadEnabled  = (sys.overload    > 0.0f);
            bool underloadEnabled = (sys.underload   > 0.0f);
            bool voltEnabled      = (sys.uv_limit    > 0 || sys.ov_limit > 0);
            bool maxrunEnabled    = (sys.maxrun_min  > 0);

            uint32_t gapMs = (sys.gap_time_s == 0 ? 10 : sys.gap_time_s) * 1000UL;

            /* ================= TANK FULL ================= */
            if (isTankFull())
            {
                stop_motor();
                semiState = SEMI_WAIT_GAP;
                semiDeadline = now + gapMs;
                Buzzer_TriggerAlert();
                break;
            }

            /* ================= HARD PROTECTION ================= */
            if ((overloadEnabled  && senseOverLoad) ||
                (underloadEnabled && senseUnderLoad) ||
                (voltEnabled      && senseOverUnderVolt) ||
                (maxrunEnabled    && senseMaxRunReached))
            {
                stop_motor();
                semiState    = SEMI_WAIT_GAP;
                semiDeadline = now + gapMs;
                break;
            }

