Amiya200/stm32_water_tank/Core/Src/model_handle.c
            switch (semiState)
            {
                /* ================= TEST PHASE ================= */
                case SEMI_RUN_TEST:
                {
                	if (isTankFull())
                	        {
                	            stop_motor();
                	            semiAutoActive = false;
                	            semiState = SEMI_RUN_TEST;
                	            semiWaterLossPending = false;
                	            Buzzer_TriggerAlert();
                	            break;
                	        }

                    if (!Motor_GetStatus())
                    {
                        start_motor();
                        semiTestStartTime = now;
                        break;
                    }

                    /* Wait for user-defined test duration */
                    if ((now - semiTestStartTime) < gapMs)
                    {
                        break;
                    }

                    /* After test time → check water */
                    if (senseDryRun == true)
                    {
                        semiState = SEMI_RUN_CONTINUOUS;
                        semiWaterLossPending = false;
                    }
                    else
                    {
                        stop_motor();
                        semiState    = SEMI_WAIT_GAP;
                        semiDeadline = now + gapMs;
                    }
                }
                break;

                /* ================= WAIT GAP ================= */
                case SEMI_WAIT_GAP:
                {
                    stop_motor();

                    if (now >= semiDeadline)
                    {
                        semiState = SEMI_RUN_TEST;
                    }
                }
                break;

                /* ================= CONTINUOUS ================= */
                case SEMI_RUN_CONTINUOUS:
                {
                    if (!Motor_GetStatus())
                        start_motor();

                    if (senseDryRun == false)
                    {
                        if (!semiWaterLossPending)
                        {
                            semiWaterLossPending = true;
                            semiWaterLossStart   = now;
                        }

                        if ((now - semiWaterLossStart) >= gapMs)
                        {
                            stop_motor();
                            semiState    = SEMI_WAIT_GAP;
                            semiDeadline = now + gapMs;
                            semiWaterLossPending = false;
                        }
                    }
                    else
                    {
                        semiWaterLossPending = false;
                    }
                }
                break;

                default:
                {
                    semiState = SEMI_RUN_TEST;
                    semiTestStartTime = 0;
                    semiWaterLossPending = false;
                }
                break;
            }
        }
        break;



        case MOTOR_OWNER_TIMER:
        {
            if (protectionFault || isTankFull())
                stop_motor();
        }
        break;
        case MOTOR_OWNER_COUNTDOWN:
        {
            uint32_t gapMs = COUNTDOWN_GAP_MS;

            /* ===== HARD STOP CONDITIONS ===== */
            if (isTankFull() || protectionFault)
            {
                ModelHandle_StopCountdown();
                Buzzer_TriggerAlert();
                break;
            }

            /* ===== STATE MACHINE ===== */
            switch (cdState)
            {
                /* ================= TEST PHASE ================= */
                case CD_RUN_TEST:
                {
                    if (!Motor_GetStatus())
                    {
                        start_motor();
                        cdTestStartTime = now;
                        break;
                    }

                    /* Run motor for 15 sec before checking water */
                    if ((now - cdTestStartTime) < gapMs)
                        break;

                    if (senseDryRun)
                    {
                        cdState = CD_RUN_CONTINUOUS;
                        cdWaterLossPending = false;
                    }
                    else
                    {
                        stop_motor();
                        cdState = CD_WAIT_GAP;
                        cdGapDeadline = now + gapMs;
                    }
                }
                break;

                /* ================= WAIT GAP ================= */
                case CD_WAIT_GAP:
                {
                    stop_motor();

                    if (now >= cdGapDeadline)
                        cdState = CD_RUN_TEST;
                }
                break;

                /* ================= CONTINUOUS ================= */
                case CD_RUN_CONTINUOUS:
                {
                    start_motor();

                    if (!senseDryRun)
                    {
                        if (!cdWaterLossPending)
                        {
                            cdWaterLossPending = true;
                            cdWaterLossStart = now;
                        }

                        if ((now - cdWaterLossStart) >= gapMs)
                        {
                            stop_motor();
                            cdState = CD_WAIT_GAP;
                            cdGapDeadline = now + gapMs;
                            cdWaterLossPending = false;
                        }
                    }
                    else
                    {
                        cdWaterLossPending = false;
                    }
                }
                break;

                default:
                    cdState = CD_RUN_TEST;
                break;
            }
            countdown_tick();
        }
        break;
        case MOTOR_OWNER_TWIST:
        {
            twist_tick();
        }
        break;
        case MOTOR_OWNER_AUTO:
        {
            auto_tick();
        }
        break;
        default:
        {
            stop_motor();
        }
        break;
    }
    if (motorOwner == MOTOR_OWNER_NONE ||
        motorOwner == MOTOR_OWNER_AUTO)
    {
        auto_mode_background_control();

        /* Re-evaluate auto after schedule re-opens */
        if (autoActive && is_schedule_allowing_run())
        {
            autoState = AUTO_ON_WAIT;
        }
    }

    leds_from_model();
    Buzzer_Update();
}

DryFSMState ModelHandle_GetDryState(void)
{
    return dryState;
}

void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();
    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;
    countdownDuration = 0;
    UART_SendStatusPacket();
}
void ModelHandle_SetUserSettings(uint32_t gap_seconds,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    if (gap_seconds > 86400UL)
        gap_seconds = 86400UL;

